In [16]:
# list of high schools
high_schools = ["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]
for schools in high_schools:
        print(schools)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [38]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]
       
for school in high_school_types:
        print(school["High School"], school["Type"])

Griffin District
Figueroa District
Wilson Charter
Wright Charter

In [5]:
high_schools = ["Huang High School",  "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [1]:
# This code tells the program to import the Pandas library as the alias pd
import pandas as pd

In [6]:
# In this code, we assign the variable school_series to the conversion of the list of high schools to a Pandas Series by using pd.Series() instead of pandas.Series(). This is how we use the alias pd in our code.

# When we run the cell, there is no direct output. The Series we just created is in computer memory. To see the output, we need to retrieve it by calling the variable school_series, like this

school_series = pd.Series(high_schools)

school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [10]:
# To create the dictionaries, in the pandas_practice.ipynb file, copy the code into a new cell.

high_school_dicts = [{"School ID": 0, "school_name": "Huang High    School", "type": "District"},
                     {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                     {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                     {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                     {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [11]:
#n the next cell, we will convert the array, or list of dictionaries, to a DataFrame using school_df = pd.DataFrame(high_school_dicts). In a new cell, type and run the following code:

school_df = pd.DataFrame(high_school_dicts)

school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [15]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [17]:
# Initialize a new DataFrame.
schools_df = pd.DataFrame()

In [18]:
# Add the list to a new DataFrame.
schools_df["School ID"] = school_id

# Print the DataFrame.
schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [21]:
schools_df["School Name"] = school_name

schools_df

   School ID            School Name
0          0      Huang High School
1          1   Figueroa High School
2          2    Shelton High School
3          3  Hernandez High School
4          4    Griffin High School

In [23]:
schools_df["Type of School"] = type_of_school

schools_df

   School ID            School Name Type of School
0          0      Huang High School       District
1          1   Figueroa High School       District
2          2    Shelton High School        Charter
3          3  Hernandez High School       District
4          4    Griffin High School        Charter

In [69]:
# Create a dictionary of information on high schools.
high_schools_dict = [{"School ID": 15, "School Name": "Wilson", "Type": "Public"},
                    {"School ID": 16, "School Name": "Kennedy", "Type": "Charter"}]

In [70]:
high_schools_df=pd.DataFrame(high_schools_dict)

high_schools_df

   School ID School Name     Type
0         15      Wilson   Public
1         16     Kennedy  Charter

In [71]:
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [72]:
school_df.index

RangeIndex(start=0, stop=5, step=1)

In [73]:
school_df.values

array([[0, 'Huang High    School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)